app/Models/PessoasModel.php

    public function getPessoas(){
        return $this->findAll();
---
SELECT *
FROM `tb_pessoas`

    public function userLogin($nome, $senha){
        return $this->asArray()
                         ->where(['nome'=>$nome,  'senha'=>MD5($senha)])
                        ->first();
---
SELECT *
FROM `tb_pessoas`
WHERE `nome` = 'pedro'
AND `senha` = '202cb962ac59075b964b07152d234b70'
 LIMIT 1